IDEA Open Model
ReferenceElement Class
Compatible with IDEA StatiCa 20.1
 Reference element class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.ReferenceElement
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReferenceElement
Public Class ReferenceElement
The ReferenceElement type exposes the following members.
Constructors
Name | Description
ReferenceElement()
 Constructor
ReferenceElement(OpenElementId)
 Constructor
Top
Properties
Name | Description
Element
 Referenced element
Id
 Element Id
TypeName
 Element type name
Top
See Also
Reference
IdeaRS.OpenModel Namespace